Revit 2027 API
WorksetId Constructor
 Create an WorksetId handle with the given integer id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetId(
	int id
)
Public Sub New (
	id As Integer
)
public:
WorksetId(
	int id
)
new :
        id : int -> WorksetId
Parameters
id Int32
The id.
See Also
Reference
WorksetId Class
Autodesk.Revit.DB Namespace